Repository: loviagin/giftText
Catalog: Localizable.xcstrings
Source language: en
Languages: es, ru

source: By using GiftText, you agree to the following terms: Subscriptions - GiftText offers optional Pro subscriptions. - Payment is charged to your Apple ID account through RevenueCat. - Subscriptions automatically renew unless canceled at least 24 hours before the end of the current period. - You can manage or cancel your subscription in your Apple ID account settings. Use of the App - GiftText is for personal, non-commercial use only. - You may not use the app for illegal or harmful purposes. - Generated content is the responsibility of the user. Third-Party Services - GiftText uses Google Gemini and Imagen to generate text and images. - GiftText uses RevenueCat to process and manage subscriptions. Disclaimer - We do not guarantee the accuracy, reliability, or appropriateness of generated content. - Service availability may vary and can be changed without notice. Contact Us If you have questions about these Terms of Use, please contact us via the company website form or email: gifttext@lovigin.com Effective Date: August 2025
es: Al utilizar GiftText, usted acepta los siguientes términos: Suscripciones - GiftText ofrece suscripciones Profesionales opcionales. - El pago se carga a su cuenta de ID de Apple a través de RevenueCat. - Las suscripciones se renuevan automáticamente a menos que se cancelen al menos 24 horas antes del final del período actual. - Puede administrar o cancelar su suscripción en la configuración de su cuenta de ID de Apple. Uso de la Aplicación - GiftText es solo para uso personal, no comercial. - No puede utilizar la aplicación con fines ilegales o dañinos. - El contenido generado es responsabilidad del usuario. Servicios de Terceros - GiftText usa Google Gemini e Imagen para generar texto e imágenes. - GiftText usa RevenueCat para procesar y administrar suscripciones. Descargo de Responsabilidad - No garantizamos la exactitud, fiabilidad o idoneidad del contenido generado. - La disponibilidad del servicio puede variar y modificarse sin previo aviso. Contacte con Nosotros Si tiene preguntas sobre estos Términos de uso, comuníquese con nosotros a través del formulario del sitio web de la compañía o por correo electrónico: gifttext@lovigin.com Fecha de vigencia: agosto de 2025
ru: Используя Giftext, вы соглашаетесь со следующими условиями: Подписки - Giftext предлагает дополнительные подписки Pro. - Оплата производится с вашего аккаунта Apple ID через RevenueCat. - Подписки автоматически продлеваются, если они не отменены по крайней мере за 24 часа до окончания текущего периода. - Вы можете изменить или отменить подписку в настройках своей учетной записи Apple ID. Использование приложения - Giftext предназначен только для личного некоммерческого использования. - Вы не имеете права использовать приложение в незаконных или вредоносных целях. - Пользователь несет ответственность за созданный контент. Сторонние сервисы - Giftext использует Google Gemini и Imagen для создания текста и изображений. - Giftext использует RevenueCat для обработки подписок и управления ими. Оговорка - Мы не гарантируем точность, надежность или уместность создаваемого контента. - Доступность услуг может варьироваться и может быть изменена без предварительного уведомления. связаться с нами Если у вас есть вопросы по поводу настоящих Условий использования, пожалуйста, свяжитесь с нами через форму на веб-сайте компании или по электронной почте: gifttext@lovigin.com Дата вступления в силу: август 2025 г.

source: GiftText respects your privacy and is committed to protecting your personal data. Information We Collect - Name: collected when you create a greeting. Used only for personalization. - Generated gifts: text and images you create are stored in your in-app chat history. - Purchase information: collected through RevenueCat to manage subscriptions. Third-Party Services - Google Gemini and Imagen: used to generate text and image greetings. - RevenueCat: used for handling in-app subscriptions and purchases. Data Usage - We do not sell or share your personal information with third parties for marketing. - Data is used only to provide app functionality (greeting generation, subscription access). Data Storage - Your generated greetings are stored locally in the app chat history. - Subscription records are processed securely through RevenueCat. Contact Us If you have questions about this Privacy Policy, please contact us via the company website form or email: gifttext@lovigin.com Effective Date: August 2025
es: GiftText respeta su privacidad y se compromete a proteger sus datos personales. Información Que Recopilamos - Nombre: se recopila cuando creas un saludo. Se usa solo para personalización. - Regalos generados: el texto y las imágenes que crees se almacenan en tu historial de chat en la aplicación. - Información de compra: recopilada a través de RevenueCat para gestionar suscripciones. Servicios de Terceros - Google Gemini e Imagen: se usa para generar saludos de texto e imágenes. - RevenueCat: se utiliza para gestionar suscripciones y compras integradas en la aplicación. Uso de Datos - No vendemos ni compartimos su información personal con terceros para fines de marketing. - Los datos se utilizan solo para proporcionar la funcionalidad de la aplicación(generación de saludos, acceso a suscripciones). Almacenamiento de Datos - Sus saludos generados se almacenan localmente en el historial de chat de la aplicación. - Los registros de suscripción se procesan de forma segura a través de RevenueCat. Contacte con Nosotros Si tiene preguntas sobre esta Política de privacidad, comuníquese con nosotros a través del formulario del sitio web de la compañía o por correo electrónico: gifttext@lovigin.com Fecha de vigencia: agosto de 2025
ru: Giftext уважает вашу конфиденциальность и стремится защищать ваши персональные данные. Информация, которую мы собираем - Имя: собирается при создании вами приветствия. Используется только для персонализации. - Созданные подарки: текст и изображения, которые вы создаете, сохраняются в истории вашего чата в приложении. - Информация о покупках: собирается с помощью RevenueCat для управления подписками. Сторонние сервисы - Google Gemini и Imagen: используются для создания текстовых и графических поздравлений. - RevenueCat: используется для обработки подписок и покупок в приложении. Использование данных - Мы не продаем и не передаем вашу личную информацию третьим лицам в маркетинговых целях. - Данные используются только для обеспечения функциональности приложения (генерация приветствий, доступ по подписке). Хранение данных - Сгенерированные вами приветствия хранятся локально в истории чата приложения. - Записи о подписке надежно обрабатываются с помощью RevenueCat. связаться с нами Если у вас есть вопросы по поводу данной Политики конфиденциальности, пожалуйста, свяжитесь с нами через форму на веб-сайте компании или по электронной почте: gifttext@lovigin.com Дата вступления в силу: август 2025

source: Do it as humanly as possible.
es: Hazlo lo más humanameste posible.
ru: Сделайте это как можно более по-человечески.

source: Don't make it too big.
es: No lo hagas demasiado grande.
ru: Не делайте его слишком большим.

source: Here are the latest congratulations:
es: Aquí están las últimas felicitaciones:
ru: Вот последние поздравления:

source: Make it about the same length as in the context.
es: Hágalo aproximadamente del mismo largo que en los saludos que le gustaron.
ru: Сделайте его примерно такой же длины, как и в контексте.

source: Make it about the same length as in the liked greetings.
es: Hágalo aproximadamente del mismo largo que en los saludos que le gustaron.
ru: Сделайте его примерно такой же длины, как в понравившихся поздравлениях.

source: Maximum of 7 sentences.
es: Máximo de 7 sestescias.
ru: Максимум 7 предложений.

source: That's all I have. Based on this, make a greeting card without additional questions.
es: Eso es todo lo que tesgo. es base a esto, haga una tarjeta de felicitación sin preguntas adicionales.
ru: Это все, что у меня есть. Исходя из этого, сделайте поздравительную открытку без дополнительных вопросов.

source: Without any introductory words, the text of congratulations immediately follows.
es: Sin palabras introductorias, el texto de felicitaciones sigue inmediatameste.
ru: Без каких-либо вступительных слов сразу же следует текст поздравления.

source: 🌠 Gift Image
es: 🌠 Imagen de Regalo
ru: 🌠 Подарок - картинка

source: A reason for congratulations
es: Un motivo de felicitación
ru: Тип поздравления

source: About App
es: Acerca de la Aplicación
ru: О приложении

source: Account
es: Cuesta
ru: Аккаунт

source: An error occurred while processing your request. Please try again later.
es: Se produjo un error al procesar su solicitud. Por favor, inténtelo de nuevo más tarde.
ru: При обработке вашего запроса произошла ошибка. Пожалуйста, повторите попытку позже.

source: Anniversary
es: Aniversario
ru: Годовщина

source: Are you sure you want to delete all of your chats?
es: ¿Estás seguro de que quieres eliminar todos tus chats?
ru: Вы уверены, что хотите удалить все чаты?

source: Are you sure you want to delete all of your Data?
es: ¿Está seguro de que desea eliminar todos sus datos?
ru: Вы уверены, что хотите удалить все данные, включая чаты и аккаунт?

source: Are you sure you want to delete this Chat?
es: ¿Estás seguro de que quieres eliminar este Chat?
ru: Вы уверены, что хотите удалить этот чат?

source: Are you sure you want to delete your Account?
es: ¿Estás seguro de que deseas eliminar tu Cuesta?
ru: Вы уверены, что хотите удалить аккаунт?

source: Baby's birth
es: Nacimiesto del bebé
ru: Рождение ребенка

source: Birthday
es: Cumpleaños
ru: День Рождения

source: By Context
es: Por Contexto
ru: По контексту

source: Cancel
es: Cancelar
ru: Отмена

source: Change Language
es: Cambiar Idioma
ru: Сменить язык

source: Choose a chat
es: Elige un chat
ru: Выберите чат

source: Christmas
es: Navidad
ru: Рождество

source: Close
es: Cerrar
ru: Закрыть

source: Congratulations!
es: ¡Felicitaciones!
ru: Поздравляем!

source: Contact us
es: Contacte con nosotros
ru: Связаться с нами

source: Context will not be applied
es: No se aplicará el contexto
ru: Контекст не будет учитываться

source: Copied
es: Copiado
ru: Скопировано

source: Copy Gift
es: Copia de Regalo
ru: Скопировать

source: Copy text
es: Copiar texto
ru: Скопировать

source: Delete
es: Suprimir
ru: Удалить

source: Delete All Chats
es: Eliminar Todos Los Chats
ru: Удалить все чаты

source: Delete All Data
es: Eliminar Todos Los Datos
ru: Удалить все данные

source: Delete chat
es: Eliminar chat
ru: Удалить чат

source: Delete My Account
es: Eliminar Mi Cuesta
ru: Удалить аккаунт

source: Developer: LOVIGIN LTD
es: Desarrollador: LOVIGIN LTD
ru: Разработчик: LOVIGIN LTD

source: Do you want to specify your name?
es: ¿Quieres especificar tu nombre?
ru: Вы хотите указать Ваше имя?

source: Donate
es: Donar
ru: Страница доната

source: Download
es: Descargar
ru: Скачать

source: Easter
es: Semana Santa
ru: Пасха

source: Edit Profile
es: Editar Perfil
ru: Изменить профиль

source: Email: gifttext@lovigin.com
es: Correo electrónico: gifttext@lovigin.com

source: Enter the gender
es: Ingrese el género
ru: Введите пол

source: Enter your name
es: Ingrese su nombre
ru: Введите Ваше имя

source: Father's Day
es: Día del Padre
ru: День отца

source: Female
es: Femenino
ru: Женский

source: For name
es: Por nombre
ru: Для

source: Generate Gift
es: Generar Regalo
ru: Создать подарок

source: Generate Image Gift
es: Generar Regalo de Imagen
ru: Создать картинку-подарок

source: Generating gift
es: Generando regalo
ru: Создание подарка

source: Gift creation request
es: Solicitud de creación de regalos
ru: Запрос создания подарка

source: Gift Style
es: Estilo de Regalo
ru: Стиль подарка

source: Graduation
es: Graduación
ru: Выпускной

source: Hello
es: Hola
ru: Привет

source: Hello, %@
es: Hola, %@
ru: Привет, %@

source: Home
es: Inicio
ru: Главная

source: In connection with the
es: En relación con el
ru: В связи с

source: It's required
es: Es obligatorio
ru: Это поле обязательно

source: Language
es: Idioma
ru: Язык

source: Let's create some gifts!
es: ¡Vamos a crear algunos regalos!
ru: Давайте создадим подарки

source: Male
es: Masculino
ru: Мужской

source: Mother's Day
es: Día de la Madre
ru: День матери

source: Name
es: Nombre
ru: Имя

source: Never ask
es: Nunca preguntes
ru: Больше не спрашивать

source: New Gift
es: Nuevo Regalo
ru: Новый

source: New Year
es: Año Nuevo
ru: Новый год

source: No chats yet
es: Aún no hay chats
ru: Чатов еще нет

source: Official
es: Oficial
ru: Официальный

source: Official website
es: Sitio web oficial
ru: Официальный сайт

source: Other
es: Otros
ru: Другой

source: Policies
es: Políticas
ru: Документы

source: Privacy Policy
es: Política de Privacidad
ru: Политика конфиденциальности

source: Regenerate
es: Regenerar
ru: Пересоздать

source: Romantic
es: Romántico
ru: Романтический

source: Save
es: Guardar
ru: Сохранить

source: Saved
es: Guardado
ru: Сохранено

source: Select chat
es: Seleccionar chat
ru: Выбрать чат

source: Select chat for context
es: Seleccione chat para contexto
ru: Выберите чат для контекста

source: Select message style
es: Seleccionar estilo de mensaje
ru: Выберите стиль подарка

source: Selected Gender:
es: Género Seleccionado:
ru: Выберите пол:

source: Sensitive Data
es: Datos Sensibles
ru: Личные данные

source: Settings
es: Ajustes
ru: Настройки

source: Share Gift
es: Compartir Regalo
ru: Поделиться

source: Share Image
es: Compartir Imagen
ru: Поделиться

source: Share your gift
es: Comparte tu regalo
ru: Поделиться подарком

source: Skip for now
es: Saltar por ahora
ru: Пропустить сейчас

source: Smile
es: Sonríe
ru: Веселый

source: Terms of Use
es: Términos de Uso
ru: Правила использования

source: Thanksgiving
es: Acción de Gracias
ru: Благодарение

source: Touching
es: Tocar
ru: Трогательный

source: Valentine's Day
es: Día de San Valentín
ru: день св Валентина

source: Version: %@
es: Versión: %@
ru: Версия: %@

source: We are generating your gift...
es: Estamos generando tu regalo...
ru: Создаем Ваш подарок ...

source: Wedding
es: Boda
ru: Свадьба

source: When you select a chat, the recipient's name will be substituted automatically
es: Cuando selecciones un chat, el nombre del destinatario se sustituirá automáticamente
ru: Когда вы выберете чат, имя получателя подставится автоматически

source: Who are we going to congratulate?
es: ¿A quién vamos a felicitar?
ru: Кого поздравляем?

source: You can choose gender (optional)
es: Puedes elegir el género (opcional)
ru: Можете указать пол

source: You can write context (e.g. last congratulations from your friend)
es: Puedes escribir contexto (por ejemplo, las últimas felicitaciones de tu amigo)
ru: Можете задать контекст (например, ваши последние поздравления)

source: You have reached the limit of images per day
es: Has alcanzado el límite de imágenes por día
ru: Вы достигли лимита создания подарков в день

source: You have reached the limit of text gifts
es: Has alcanzado el límite de regalos de texto
ru: Вы достигли лимита создания подарков

source: You have reached the limit of text regeneration per day
es: Ha alcanzado el límite de regeneración de texto por día
ru: Вы достигли лимита перегенерации текста в день

source: You're welcome!
es: ¡De nada!
ru: Добро пожаловать

source: Your Gift
es: Tu Regalo
ru: Ваш подарок

source: Your gift is ready!
es: ¡Tu regalo está listo!
ru: Ваш подарок готов!

source: Chat: %@
ru: Чат: %@

source: Chats
ru: Чаты

source: OK
ru: Ок
